JUPYTER NOTEBOOK CREATED BY

# DR. RAJAN GUPTA
# DEEN DAYAL UPADHYAYA COLLEGE
# UNIVERSITY OF DELHI
# rgupta.cs.du@gmail.com

In [ ]:
#This will contain the content of Unit 3 from Chapter 7

UNIT III - Data Preprocessing and Transformation: Handling of missing data, Data cleaning and transformation [Chapter 7 (upto page No.213)]

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming, and rearranging. Such tasks are often reported to take up 80% or more of an analyst’s time.

In [ ]:
#Import the libraries
import pandas as pd
import numpy as np

**Handling Missing Data**

For numeric data, pandas uses the floating-point value NaN (Not a Number) to represent missing data. We call this a sentinel value.

In [ ]:
#Creating a series with a delebrate Nan value in between
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
#checking the Null/NaN values
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
#None is also treated as NaN
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
#checking the null values now
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
#Checking how many values are Not Null values (not Nan)
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

**FIltering out missing data**

There are a few ways to filter out missing data.

In [ ]:
#import NaN as NA from numpy
from numpy import nan as NA

In [ ]:
#Dropping NA from data series
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#Same thing can be achieved through boolean values also
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#Dropping NA from Dataframes
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#Dropna will remove both all the rows with having even a single NA value
data_cleaned = data.dropna()
data_cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
#We may want to drop only those rows having all NA values
data_cleaned = data.dropna(how='all')
data_cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#columns with NA can also be dropped using axis parameter
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
#drop columns with all NaN
data_cleaned = data.dropna(axis=1, how='all')
data_cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.530764  0.545630  1.265731
1 -1.339729  1.386883  1.249585
2 -1.284724  1.457497  0.038540
3  0.653963  0.829086  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.530764       NaN       NaN
1 -1.339729       NaN       NaN
2 -1.284724       NaN  0.038540
3  0.653963       NaN  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
#dropping rows with NaN
df.dropna()

          0         1         2
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
#we may restrict the dropping of NaN to a certain number of rows
df.dropna(thresh=2)

          0         1         2
2 -1.284724       NaN  0.038540
3  0.653963       NaN  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

**Filling in Missing Data**

Rather than filtering out missing data (and potentially discarding other data along with it), you may want to fill in the “holes” in any number of ways. For most purposes, the fillna method is the workhorse function to use. Calling fillna with a constant replaces missing values with that value.

In [ ]:
df

          0         1         2
0  0.530764       NaN       NaN
1 -1.339729       NaN       NaN
2 -1.284724       NaN  0.038540
3  0.653963       NaN  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
#filling the NaN values
df.fillna(0)

          0         1         2
0  0.530764  0.000000  0.000000
1 -1.339729  0.000000  0.000000
2 -1.284724  0.000000  0.038540
3  0.653963  0.000000  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
#instead of filling with all constants, we may fill with different values in col
# e.g. 0.5 for NaN in column 1, 0 for NaN in column 2
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.530764  0.500000  0.000000
1 -1.339729  0.500000  0.000000
2 -1.284724  0.500000  0.038540
3  0.653963  0.500000  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

In [ ]:
#We can also fill the NaN value with a value inplace of the dataframe
df.fillna(0, inplace=True)

In [ ]:
df

          0         1         2
0  0.530764  0.000000  0.000000
1 -1.339729  0.000000  0.000000
2 -1.284724  0.000000  0.038540
3  0.653963  0.000000  0.227282
4  0.466895 -0.763463 -0.412141
5  0.714693  0.665988  1.063653
6 -1.055758 -1.677492  2.490752

The same interpolation methods available for reindexing can be used with fillna

In [ ]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.888988  0.114704  0.493282
1  1.194963  0.996953  0.711903
2 -0.692771  1.254737 -0.187664
3  0.916395 -0.090426  0.645923
4 -0.049542 -2.171137  2.029902
5  0.164884  0.624474 -1.450171

In [ ]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.888988  0.114704  0.493282
1  1.194963  0.996953  0.711903
2 -0.692771       NaN -0.187664
3  0.916395       NaN  0.645923
4 -0.049542       NaN       NaN
5  0.164884       NaN       NaN

In [ ]:
#filling with forward fill from the last filled value
df.fillna(method='ffill')

          0         1         2
0 -0.888988  0.114704  0.493282
1  1.194963  0.996953  0.711903
2 -0.692771  0.996953 -0.187664
3  0.916395  0.996953  0.645923
4 -0.049542  0.996953  0.645923
5  0.164884  0.996953  0.645923

In [ ]:
#we can limit to the forward filling by mentioning threshold
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.888988  0.114704  0.493282
1  1.194963  0.996953  0.711903
2 -0.692771  0.996953 -0.187664
3  0.916395  0.996953  0.645923
4 -0.049542       NaN  0.645923
5  0.164884       NaN  0.645923

In [ ]:
#We can fill the NaN values with mean of the remaining items
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
data.mean()

3.8333333333333335

In [ ]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

**DATA TRANSFORMATION**

**Removing Duplicates**

Duplicate rows may be found in a DataFrame for any number of reasons.

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
#The DataFrame method duplicated returns a boolean Series indicating whether each
#row is a duplicate (has been observed in a previous row) or not
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
#drop_duplicates returns a DataFrame where the duplicated array is False
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
#inserting a third column in data
data['k3']=range(7)
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [ ]:
#we can remove duplicate entries based on a single column as well
data.drop_duplicates(['k1'])

    k1  k2  k3
0  one   1   0
1  two   1   1

duplicated and drop_duplicates by default keep the first observed value combination.
Passing keep='last' will return the last one

In [ ]:
#now 6th row will be dropped instead of the 7th row
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transforming Data Using a Function or Mapping**

For many datasets, you may wish to perform some transformation based on the values
in an array, Series, or column in a DataFrame. Using map is a convenient way to perform element-wise transformations and other data cleaning–related operations

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose we wanted to add a column indicating the type of animal that each food came from.

In [ ]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [ ]:
#we will map them to the dataset. first we will convert strings to lower case
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
#now we will map them using map function
daata['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
#we can also create a lambda function for the above similar task
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Replacing Values**

Filling in missing data with the fillna method is a special case of more general value replacement. As you’ve already seen, map can be used to modify a subset of values in an object but replace provides a simpler and more flexible way to do so

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
#The -999 values might be sentinel values for missing data. To replace these with NA
# values that pandas understands, we can use replace
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
#If you want to replace multiple values at once, you instead pass a list and 
# then the substitute value
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
# To use a different replacement for each value, pass a list of substitutes
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
#For different value replacement, the argument passed can also be a dict
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

Like values in a Series, axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
#Like a Series, the axis indexes have a map method
#we are tranforming the first four characters to uppercase from index labels
transform = lambda x: x[:4].upper()
transform

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
#If you want to create a transformed version of a dataset without 
# modifying the original, a useful method is rename
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
#rename can be used in conjunction with a dict-like object providing new values
#for a subset of the axis labels
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
#renaming inplace
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

**Discretization & Binning**

Continuous data is often discretized or otherwise separated into “bins” for analysis

In [ ]:
#dividing ages into different groups
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
#we use cut function from pandas to divide the data into bins
bins = [18, 25, 35, 60, 100]
category = pd.cut(ages, bins)
category

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
#checking the codes of the categories created. by default starts with 0
category.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
#check which all categories have been created
category.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
#counting the items in each category
pd.value_counts(category)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive). You can change which
side is closed by passing right=False

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
#We can also pass our own bin names by passing a list or array to the labels option
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute
equal-length bins based on the minimum and maximum values in the data

In [ ]:
data = np.random.rand(20)
#The precision=2 option limits the decimal precision to two digits
pd.cut(data, 4, precision=2)

[(0.25, 0.47], (0.25, 0.47], (0.25, 0.47], (0.47, 0.69], (0.026, 0.25], ..., (0.026, 0.25], (0.026, 0.25], (0.47, 0.69], (0.25, 0.47], (0.47, 0.69]]
Length: 20
Categories (4, interval[float64]): [(0.026, 0.25] < (0.25, 0.47] < (0.47, 0.69] < (0.69, 0.91]]

A closely related function, qcut, bins the data based on sample quantiles. Depending
on the distribution of the data, using cut will not usually result in each bin having the
same number of data points. Since qcut uses sample quantiles instead, by definition
you will obtain roughly equal-size bins

In [ ]:
#normally distributed data
data = np.random.randn(1000)

In [ ]:
#cuts the data into quartiles i.e. 4 equal halves
cats = pd.qcut(data, 4)
cats

[(0.769, 3.059], (-3.9379999999999997, -0.655], (0.0493, 0.769], (0.769, 3.059], (0.0493, 0.769], ..., (-3.9379999999999997, -0.655], (0.0493, 0.769], (0.0493, 0.769], (0.0493, 0.769], (-3.9379999999999997, -0.655]]
Length: 1000
Categories (4, interval[float64]): [(-3.9379999999999997, -0.655] < (-0.655, 0.0493] < (0.0493, 0.769] <
                                    (0.769, 3.059]]

In [ ]:
#Just checking whether 4 equal halves have been created or not
pd.value_counts(cats)

(0.769, 3.059]                   250
(0.0493, 0.769]                  250
(-0.655, 0.0493]                 250
(-3.9379999999999997, -0.655]    250
dtype: int64

In [ ]:
#Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive)
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats

[(0.0493, 1.423], (-3.9379999999999997, -1.292], (0.0493, 1.423], (1.423, 3.059], (0.0493, 1.423], ..., (-1.292, 0.0493], (0.0493, 1.423], (0.0493, 1.423], (0.0493, 1.423], (-1.292, 0.0493]]
Length: 1000
Categories (4, interval[float64]): [(-3.9379999999999997, -1.292] < (-1.292, 0.0493] < (0.0493, 1.423] <
                                    (1.423, 3.059]]

In [ ]:
pd.value_counts(cats)

(0.0493, 1.423]                  400
(-1.292, 0.0493]                 400
(1.423, 3.059]                   100
(-3.9379999999999997, -1.292]    100
dtype: int64

**Detecting and Filtering Outliers**

Filtering or transforming outliers is largely a matter of applying array operations

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [ ]:
#Finding the decriptives of the data
#VERY USEFUL INFORMATION FOR DATA ANALYSIS
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042463     0.027113     0.011655     0.025049
std       1.023031     1.018313     0.969959     0.990965
min      -3.430963    -3.075653    -2.853324    -3.218305
25%      -0.742770    -0.656126    -0.654829    -0.631204
50%      -0.027370     0.043852    -0.028523     0.087195
75%       0.638737     0.698342     0.644103     0.672590
max       3.251251     3.110308     3.789907     3.259563

In [ ]:
#Finding values in one of the columns exceeding 3 in absolute value
col = data[2]
col[np.abs(col) > 3]

281    3.789907
433    3.535944
Name: 2, dtype: float64

In [ ]:
#To select all rows having a value exceeding 3 or –3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
81   0.438569 -3.061987 -0.467562  0.824923
108  1.922721  0.018394 -1.289916 -3.218305
152 -1.385793 -0.575558  0.745757 -3.016625
200  1.026878  3.110308  0.473244 -0.225219
208 -1.844733  0.790983 -0.876292  3.038665
281 -1.942265 -0.672129  3.789907  0.221454
362 -0.889004 -0.765013 -2.180943 -3.034391
413 -1.149896 -3.030492 -0.345485  1.126621
433 -0.300124  1.103694  3.535944  1.703863
447 -3.430963 -0.294931 -0.382215 -1.103168
765  1.340118  1.583872  0.758151 -3.155567
787  1.075204 -3.075653 -0.057793  0.838577
853  3.251251 -0.132206 -1.105560 -0.070348
968 -1.984709 -1.635368  0.593069  3.259563

In [ ]:
#Values can be set based on these criteria
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042283     0.027170     0.010329     0.025175
std       1.020912     1.017478     0.965388     0.988696
min      -3.000000    -3.000000    -2.853324    -3.000000
25%      -0.742770    -0.656126    -0.654829    -0.631204
50%      -0.027370     0.043852    -0.028523     0.087195
75%       0.638737     0.698342     0.644103     0.672590
max       3.000000     3.000000     3.000000     3.000000

In [ ]:
#The statement np.sign(data) produces 1 and –1 values based on whether the values
#in data are positive or negative
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0  1.0  1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0  1.0

**Permutation & Random Sampling**

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function. Calling permutation with the length
of the axis you want to permute produces an array of integers indicating the new
ordering

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
sampler = np.random.permutation(5)
sampler

array([3, 1, 4, 2, 0])

In [ ]:
#rearranging df based on the sampler
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [ ]:
#To select a random subset without replacement, you can use the sample method 
#on Series and DataFrame
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [ ]:
#everytime it will randomly select 3 rows and show in the output
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [ ]:
#To generate a sample with replacement (to allow repeat choices), pass replace=True
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [ ]:
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
3    6
3    6
0    5
2   -1
1    7
2   -1
2   -1
2   -1
dtype: int64

**Computing Indicator/Dummy Variables**

Another type of transformation for statistical modeling or machine learning applications
is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s. pandas has a get_dummies function
for doing this, though devising one yourself is not difficult.

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
#We may want to add a prefix to the columns in the indicator 
#Data‐Frame, which can then be merged with the other data
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [ ]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

A useful recipe for statistical applications is to combine get_dummies with a discretization
function like cut

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

**STRING MANIPULATION**

**String Object Methods**

In [ ]:
#a comma-separated string can be broken into pieces with split
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [ ]:
#split is often combined with strip to trim whitespace (including line breaks)
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [ ]:
#substrings could be concatenated together with a two-colon delimiter using addition
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [ ]:
#faster and more Pythonic way is to pass a
#list or tuple to the join method on the string '::'
'::'.join(pieces)

'a::b::guido'

In [ ]:
#Other methods are concerned with locating substrings
'guido' in val

True

In [ ]:
val.index(',')

1

In [ ]:
val.find(':')

-1

the difference between find and index is that index raises an exception if the
string isn’t found (versus returning –1)

In [ ]:
val.index(':')

ValueError: ignored

In [ ]:
#count returns the number of occurrences of a particular substring
val.count(',')

2

In [ ]:
#replace will substitute occurrences of one pattern for another
val.replace(',', '::')

'a::b:: guido'

In [ ]:
val.replace(',', '')

'ab guido'